In [77]:
import pandas as pd
from pandas import Series,DataFrame

In [78]:
obj = Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [79]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [80]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [81]:
obj.name = 'test'
obj.index.name= 'haha'
obj

haha
0    4
1    7
2   -5
3    3
Name: test, dtype: int64

In [82]:
obj.index = ['aa','bb','dd','cc']
obj

aa    4
bb    7
dd   -5
cc    3
Name: test, dtype: int64

In [83]:
data = {'state':['a','b','c','d','d'],
       'year':[2011,2002,2001,2011,2003],
       'pop':[1.5,1.7,6.3,2.9,2.4]}
frame = DataFrame(data)
print(frame)

  state  year  pop
0     a  2011  1.5
1     b  2002  1.7
2     c  2001  6.3
3     d  2011  2.9
4     d  2003  2.4

In [84]:
a = pd.Series([1,2,3],index=['a','b','c'])
a

a    1
b    2
c    3
dtype: int64

In [85]:
df = pd.DataFrame(data,columns=['year','state','pop'])
df

   year state  pop
0  2011     a  1.5
1  2002     b  1.7
2  2001     c  6.3
3  2011     d  2.9
4  2003     d  2.4

In [86]:
sdata = {'ohio':35000,'texas':7100,'oregon':16000,'utah':5000}
states={'california','texas','haha','hello','wuwu'}
obj = pd.Series(sdata,index=states)
obj

wuwu             NaN
hello            NaN
california       NaN
texas         7100.0
haha             NaN
dtype: float64

In [87]:
sdata = [35000,7100,16000,5000]
states={'california','ohio','oregon','texas'}
obj = pd.Series(sdata,index=states)
obj

ohio          35000
california     7100
texas         16000
oregon         5000
dtype: int64

In [88]:
pop = {'a':{'A':1,'B':2},
      'b':{'C':3,'D':5}}
df = pd.DataFrame(pop)
print(df)
print(df.T)

     a    b
A  1.0  NaN
B  2.0  NaN
C  NaN  3.0
D  NaN  5.0
     A    B    C    D
a  1.0  2.0  NaN  NaN
b  NaN  NaN  3.0  5.0

In [89]:
df.index.name = 'aaa'
df.columns.name = 'AAA'
print(df)

AAA    a    b
aaa
A    1.0  NaN
B    2.0  NaN
C    NaN  3.0
D    NaN  5.0

In [90]:
df.values

array([[ 1., nan],
       [ 2., nan],
       [nan,  3.],
       [nan,  5.]])

In [91]:
obj = pd.Series([4.5,7.2,-5.3,3.6],index=['d','b','a','c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [92]:
obj2 = obj.reindex(['a','b','c','d','e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [93]:
obj.reindex(['a','b','c','d','e'],fill_value=0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [94]:
obj3 = pd.Series(['blue','yellow','red'],index=[0,2,3])
print(obj3)
print(obj3.reindex(range(6),method='ffill'))

0      blue
2    yellow
3       red
dtype: object
0      blue
1      blue
2    yellow
3       red
4       red
5       red
dtype: object

In [95]:
import numpy as np
frame = pd.DataFrame(np.arange(9).reshape((3,3)),index=['a','d','c'],
                     columns=['ohio','texas','california'])
frame

   ohio  texas  california
a     0      1           2
d     3      4           5
c     6      7           8

In [98]:
frame.reindex(['a','b','c','d'])

   ohio  texas  california
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   6.0    7.0         8.0
d   3.0    4.0         5.0

In [99]:
# 使用columns重新索引列
states = ['texas','california','bala']
frame.reindex(columns = states)

   texas  california  bala
a      1           2   NaN
d      4           5   NaN
c      7           8   NaN

In [100]:
frame

   ohio  texas  california
a     0      1           2
d     3      4           5
c     6      7           8

In [103]:
frame.reindex(index=['a','b','c','d'],columns=states).ffill()

   texas  california  bala
a    1.0         2.0   NaN
b    1.0         2.0   NaN
c    7.0         8.0   NaN
d    4.0         5.0   NaN

In [106]:
frame.ix[['a','b','c','d'],states]

C:\Users\Dell\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.
C:\Users\Dell\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  """Entry point for launching an IPython kernel.

   texas  california  bala
a    1.0         2.0   NaN
b    NaN         NaN   NaN
c    7.0         8.0   NaN
d    4.0         5.0   NaN

In [109]:
obj = pd.Series(np.arange(5.),index=['a','b','c','d','e'])
new_obj = obj.drop('c')  
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [120]:
# 索引选取和过滤
obj = pd.Series(np.arange(4.),index = ['a','b','c','d'])
print(obj['b'])
# 必须嵌套两层
print(obj[[1]])
print('------')
print(obj[1:3])
print(obj[['b','a']])
print(obj[[1,3]])
print(obj[obj<2])

1.0
b    1.0
dtype: float64
------
b    1.0
c    2.0
dtype: float64
b    1.0
a    0.0
dtype: float64
b    1.0
d    3.0
dtype: float64
a    0.0
b    1.0
dtype: float64

In [122]:
print(obj['b':'d'])

b    1.0
c    2.0
d    3.0
dtype: float64

In [123]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),
                   index=['ohio','colorado','utah','new york'],
                   columns=['one','two','three','four'])

data[:2]

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7

In [124]:
data[['three','one']]

          three  one
ohio          2    0
colorado      6    4
utah         10    8
new york     14   12

In [126]:
data[data['three']>5]

          one  two  three  four
colorado    4    5      6     7
utah        8    9     10    11
new york   12   13     14    15

In [127]:
data[data['three']>5] = 0

In [128]:
data

          one  two  three  four
ohio        0    1      2     3
colorado    0    0      0     0
utah        0    0      0     0
new york    0    0      0     0

In [129]:
data.ix['ohio']

C:\Users\Dell\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

one      0
two      1
three    2
four     3
Name: ohio, dtype: int32

In [137]:
?data.iloc